; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v2 - type_3 ?v8 - type_2)
 	      (pred_4 ?v4 - object ?v8 - type_2)
	      (pred_3 ?v2 - type_3 ?v3 - type_1)
	      (pred_1 ?v2 - type_3 ?v4 - object ?v3 - type_1))

   (:action op_3
       :parameters  (?v2 - type_3 ?v5 ?v1 - type_2)
       :precondition (and  (pred_2 ?v2 ?v5))
       :effect (and  (pred_2 ?v2 ?v1)
		     (not (pred_2 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_3 ?v6 - object ?v7 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v7) (pred_2 ?v2 ?v7) (pred_3 ?v2 ?v3))
       :effect (and (pred_1 ?v2 ?v6 ?v3)
		    (not (pred_4 ?v6 ?v7)) 
		    (not (pred_3 ?v2 ?v3))))

   (:action op_2
       :parameters (?v2 - type_3 ?v6 - object ?v7 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_1 ?v2 ?v6 ?v3) (pred_2 ?v2 ?v7))
       :effect (and (pred_4 ?v6 ?v7)
		    (pred_3 ?v2 ?v3)
		    (not (pred_1 ?v2 ?v6 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_12 obj_03 - type_3
obj_02 obj_13 obj_09 obj_10 - type_1
obj_01 obj_08 obj_06 obj_14 - type_2
obj_11 obj_05 obj_07 obj_04 - object)
(:init
(pred_2 obj_12 obj_06)
(pred_3 obj_12 obj_02)
(pred_3 obj_12 obj_13)
(pred_2 obj_03 obj_14)
(pred_3 obj_03 obj_09)
(pred_3 obj_03 obj_10)
(pred_4 obj_11 obj_01)
(pred_4 obj_05 obj_08)
(pred_4 obj_07 obj_01)
(pred_4 obj_04 obj_08)
)
(:goal
(and
(pred_4 obj_11 obj_08)
(pred_4 obj_05 obj_06)
(pred_4 obj_07 obj_01)
(pred_4 obj_04 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_12 obj_08) (pred_2 obj_03 obj_08))))
  )
)
)

; plan
1. (op_3 obj_03 obj_14 obj_01)
   deleted: (pred_2 obj_03 obj_14)
   added: (pred_2 obj_03 obj_01)
   goals met: 2 of 4
2. (op_1 obj_03 obj_11 obj_01 obj_10)
   deleted: (pred_4 obj_11 obj_01) (pred_3 obj_03 obj_10)
   added: (pred_1 obj_03 obj_11 obj_10)
   goals met: 2 of 4
3. (op_3 obj_03 obj_01 obj_08)
   deleted: (pred_2 obj_03 obj_01)
   added: (pred_2 obj_03 obj_08)
   goals met: 2 of 4
4. (op_2 obj_03 obj_11 obj_08 obj_10)
   deleted: (pred_1 obj_03 obj_11 obj_10)
   added: (pred_4 obj_11 obj_08) (pred_3 obj_03 obj_10)
   goals met: 3 of 4
5. (op_1 obj_03 obj_05 obj_08 obj_10)
   deleted: (pred_4 obj_05 obj_08) (pred_3 obj_03 obj_10)
   added: (pred_1 obj_03 obj_05 obj_10)
   goals met: 3 of 4
6. (op_3 obj_03 obj_08 obj_06)
   deleted: (pred_2 obj_03 obj_08)
   added: (pred_2 obj_03 obj_06)
   goals met: 3 of 4
7. (op_2 obj_03 obj_05 obj_06 obj_10)
   deleted: (pred_1 obj_03 obj_05 obj_10)
   added: (pred_4 obj_05 obj_06) (pred_3 obj_03 obj_10)
   goals met: 4 of 4
